app/Controllers/Laporan.php

    public function index()
    {
        $data['transaksi'] = $this->parkirModel
            ->where('waktu_keluar IS NOT NULL')
            ->orderBy('waktu_masuk', 'DESC')
            ->findAll();
---
SELECT *
FROM `parkir`
WHERE `waktu_keluar` IS NOT NULL
ORDER BY `waktu_masuk` DESC

    public function filter()
    {
        $data = [];
        $dari   = $this->request->getGet('dari');
        $sampai = $this->request->getGet('sampai');

        // Memastikan kedua tanggal filter ada
        if ($dari && $sampai) {
            $data['transaksi'] = $this->parkirModel
                ->where('DATE(waktu_keluar) >=', $dari)
                ->where('DATE(waktu_keluar) <=', $sampai)
                ->where('waktu_keluar IS NOT NULL')
                ->orderBy('waktu_keluar', 'DESC')
                ->findAll();
---
SELECT *
FROM `parkir`
WHERE DATE(waktu_keluar) >= '2025-06-03'
AND DATE(waktu_keluar) <= '2025-07-16'
AND `waktu_keluar` IS NOT NULL
ORDER BY `waktu_keluar` DESC