app/Controllers/Parkir.php

     public function simpanMasuk()
    {
        $rules = [
            'plat_nomor' => 'required|min_length[3]|max_length[20]',
            'jenis_kendaraan' => 'required|in_list[roda_2,roda_4]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Pastikan format waktu benar
        $waktu_masuk = date('Y-m-d H:i:s');

        $data = [
            'plat_nomor' => strtoupper($this->request->getVar('plat_nomor')),
            'jenis_kendaraan' => $this->request->getVar('jenis_kendaraan'),
            'waktu_masuk' => $waktu_masuk,
            'waktu_keluar' => null
        ];

        log_message('debug', 'Waktu masuk: '.$waktu_masuk);
        $this->parkirModel->save($data);
---
INSERT INTO `parkir` (`plat_nomor`, `jenis_kendaraan`, `waktu_masuk`, `waktu_keluar`) VALUES ('Z 786CDSW', 'roda_4', '2025-07-16 12:15:11', NULL)

   public function formKeluar()
    {
        $data['parkir'] = $this->parkirModel->where('waktu_keluar', null)->findAll();
---
SELECT *
FROM `parkir`
WHERE `waktu_keluar` IS NULL

    public function simpanKeluar()
    {
        $id = $this->request->getVar('id');
        $parkir = $this->parkirModel->find($id);

        if (!$parkir) {
            return redirect()->back()->with('error', 'Data tidak ditemukan');
        }

        // Ambil waktu sekarang
        $waktu_keluar = date('Y-m-d H:i:s');

        // Hitung durasi
        $waktu_masuk = strtotime($parkir['waktu_masuk']);
        $waktu_keluar_timestamp = strtotime($waktu_keluar);
        $durasi = $waktu_keluar_timestamp - $waktu_masuk;

        // Jaga-jaga jika ada selisih minus
        if ($durasi < 0) {
            $durasi = 0;
        }

        // Konversi ke jam
        $durasi_jam = ceil($durasi / 3600);

        // Ambil tarif
        $tarif = $this->tarifModel->where('jenis_kendaraan', $parkir['jenis_kendaraan'])->first();
---
SELECT *
FROM `parkir`
WHERE `parkir`.`id` = '18'
SELECT *
FROM `tarif`
WHERE `jenis_kendaraan` = 'roda_4'
 LIMIT 1

            'biaya' => $biaya
        ];

        $this->parkirModel->update($id, $data);
---
UPDATE `parkir` SET `waktu_keluar` = '2025-07-16 12:15:28', `durasi` = 34, `biaya` = 5000
WHERE `parkir`.`id` IN ('18')