app/Controllers/Tarif.php

SELECT *
FROM `tarif`
---
    public function index()
    {
        $data['tarif'] = $this->tarifModel->findAll();

UPDATE `tarif` SET `tarif_per_jam` = '3000'
WHERE `tarif`.`id` IN (1)
---
    public function update()
    {

        $tarifData = $this->request->getPost('tarif');

        // Inisialisasi aturan validasi
        $rules = [];
        if (!empty($tarifData)) {
            foreach ($tarifData as $id => $tarif) {
                $rules["tarif.{$id}"] = 'required|numeric|greater_than_equal_to[0]';
            }
        } else {

        }


        if (! $this->validate($rules)) {

            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }


        foreach ($tarifData as $id => $tarif) {
            $this->tarifModel->update($id, ['tarif_per_jam' => $tarif]);